#+BEGIN_SRC emacs-lisp
  (defun order-by-couple (couple-scores)
    (sort couple-scores (lambda (a b)(< (cadr a) (cadr b)))))
#+END_SRC

#+RESULTS:
: order-by-couple

* Example 1:
#+BEGIN_SRC emacs-lisp
  (score-single-dance '((21	7	7	7	7	6)
                        (22	1	2	1	2	3)
                        (23	5	6	5	6	7)
                        (24	2	1	3	4	1)
                        (25	6	5	6	3	5)
                        (26	3	4	2	1	2)
                        (27	4	3	4	5	4)))
  #+END_SRC

  #+RESULTS:
  | 1 | 22 |
  | 2 | 24 |
  | 3 | 26 |
  | 4 | 27 |
  | 5 | 25 |
  | 6 | 23 |
  | 7 | 21 |

* Example 2:
#+BEGIN_SRC emacs-lisp

#+END_SRC

#+NAME:Waltz				
#+BEGIN_SRC emacs-lisp
'((111	5	4	2	4	4)
(112	4	2	1	2	2)
(113	1	1	3	1	1)
(114	3	3	4	3	3)
(115	2	5	5	5	5))
#+END_SRC

#+RESULTS:
| 111 | 5 | 4 | 2 | 4 | 4 |
| 112 | 4 | 2 | 1 | 2 | 2 |
| 113 | 1 | 1 | 3 | 1 | 1 |
| 114 | 3 | 3 | 4 | 3 | 3 |
| 115 | 2 | 5 | 5 | 5 | 5 |

#+BEGIN_SRC emacs-lisp :var dance=Waltz
  (score-single-dance dance)
#+END_SRC

#+NAME:Waltz-results
| 1 | 113 |
| 2 | 112 |
| 3 | 114 |
| 4 | 111 |
| 5 | 115 |

#+NAME: Tango				
#+BEGIN_SRC emacs-lisp
(setq couples '(111 112 113 114 115))
'((111	5	4	3	4	4)
(112	3	1	1	1	1)
(113	1	3	2	2	2)
(114	4	2	4	3	3)
(115	2	5	5	5	5))
#+END_SRC

#+RESULTS: Tango
| 111 | 5 | 4 | 3 | 4 | 4 |
| 112 | 3 | 1 | 1 | 1 | 1 |
| 113 | 1 | 3 | 2 | 2 | 2 |
| 114 | 4 | 2 | 4 | 3 | 3 |
| 115 | 2 | 5 | 5 | 5 | 5 |
#+BEGIN_SRC emacs-lisp :var dance=Tango
  (score-single-dance dance)
#+END_SRC


#+NAME: Tango-results
| 1 | 112 |
| 2 | 113 |
| 3 | 114 |
| 4 | 111 |
| 5 | 115 |

					
#+NAME: Foxtrot				
#+BEGIN_SRC emacs-lisp  
'((111	5	5	3	4	4)
(112	3	1	4	1	1)
(113	1	2	1	2	2)
(114	4	3	2	3	3)
(115	2	4	5	5	5))
#+END_SRC

#+RESULTS: Foxtrot
| 111 | 5 | 5 | 3 | 4 | 4 |
| 112 | 3 | 1 | 4 | 1 | 1 |
| 113 | 1 | 2 | 1 | 2 | 2 |
| 114 | 4 | 3 | 2 | 3 | 3 |
| 115 | 2 | 4 | 5 | 5 | 5 |

#+BEGIN_SRC emacs-lisp :var dance=Foxtrot
  (score-single-dance dance)
#+END_SRC

#+NAME: Foxtrot-results
| 1 | 112 |
| 2 | 113 |
| 3 | 114 |
| 4 | 111 |
| 5 | 115 |
	
#+NAME: Viennese
#+BEGIN_SRC emacs-lisp
'((111	5	5	4	4	4)
(112	3	2	3	1	2)
(113	1	1	2	2	1)
(114	2	3	1	3	3)
(115	4	4	5	5	5))
#+END_SRC

#+RESULTS: Viennese 
| 111 | 5 | 5 | 4 | 4 | 4 |
| 112 | 3 | 2 | 3 | 1 | 2 |
| 113 | 1 | 1 | 2 | 2 | 1 |
| 114 | 2 | 3 | 1 | 3 | 3 |
| 115 | 4 | 4 | 5 | 5 | 5 |

#+BEGIN_SRC emacs-lisp :var dance=Viennese
  (score-single-dance dance)
#+END_SRC

#+NAME:Viennese-results
| 1 | 113 |
| 2 | 112 |
| 3 | 114 |
| 4 | 111 |
| 5 | 115 |

